### Exercise 1.03: Using a dataset to demonstrate how Pandas reads a file into DataFrame

#### 1.  Use Colab

#### 2.  Import necessary Python packages for the exercise

In [1]:
import pandas as pd
import sklearn

#### 3.  Read the csv file into dataframe.

In [2]:
# from google.colab import files
# uploaded = files.upload()

Saving tas_1991_2016_AUS.csv to tas_1991_2016_AUS.csv

In [2]:
temp_aus_df =pd.read_csv("tas_1991_2016_AUS.csv")

#### 3. Use Pandas head function to print the first few rows of the Dataframe, temp_aus_df

In [3]:
temp_aus_df.head()

   Temperature - (Celsius)   Year  Month     Country  ISO3
0                  28.2684   1991    Jan   Australia   AUS
1                  27.9415   1991    Feb   Australia   AUS
2                  25.7541   1991    Mar   Australia   AUS
3                  22.2463   1991    Apr   Australia   AUS
4                  18.4007   1991    May   Australia   AUS

#### 4. Use Pandas head function to print the first few rows of the DataFrame, temp_aus_df

In [9]:
temp_aus_df.head()

   temperature  year month     country   cty
0      28.2684  1991   Jan   Australia   AUS
1      27.9415  1991   Feb   Australia   AUS
2      25.7541  1991   Mar   Australia   AUS
3      22.2463  1991   Apr   Australia   AUS
4      18.4007  1991   May   Australia   AUS

#### 5. Use Pandas tail function to print the last few rows of the dataframe

In [4]:
temp_aus_df.tail()

     Temperature - (Celsius)   Year  Month     Country  ISO3
307                  16.1341   2016    Aug   Australia   AUS
308                  18.8000   2016    Sep   Australia   AUS
309                  22.0308   2016    Oct   Australia   AUS
310                  25.7045   2016    Nov   Australia   AUS
311                  27.5676   2016    Dec   Australia   AUS

#### 6. Now, find the total number of records/rows/observations in the DataFrame

In [5]:
len(temp_aus_df)

312

#### 7. Now, to find the datatypes of the columns in the DataFrame

In [7]:
temp_aus_df.dtypes

Temperature - (Celsius)    float64
 Year                        int64
 Month                      object
 Country                    object
 ISO3                       object
dtype: object

#### 8. To find the missing values in the dataframe as mentioned in the following code snippet

In [8]:
temp_aus_df.isnull().sum()

Temperature - (Celsius)    0
 Year                      0
 Month                     0
 Country                   0
 ISO3                      0
dtype: int64

#### 9. Now, replace the missing values in DataFrame

In [9]:
for colname in temp_aus_df.columns:
    if temp_aus_df[colname].dtype == 'object':
        temp_aus_df[colname] = temp_aus_df[colname].fillna('others')
    else:
        temp_aus_df[colname] = temp_aus_df[colname].fillna(0)

#### 10. Save Dataframe to disk

In [11]:
temp_aus_df.to_csv('newdata.csv', index=False)

#### 9. Save the model